export const items: any = [
  {
    id: 6,
    title: "বুধবার, ৩১ জানুয়ারী, ২০১৮",
    date: "2018-01-31",
    items: [
      {
        id: 1,
        cardTitle: "রিট দায়ের",
        cardSubtitle: "",
        cardDetailedText:
          "সরকারি চাকরিতে কোটাপ্রথা বাতিল করে পুনর্মূল্যায়ন চেয়ে ঢাকা বিশ্ববিদ্যালয়ের এক ছাত্র ও দুই সাংবাদিকের পক্ষে রিট দায়ের। রিট দায়ের করে আইনজীবী এখলাছ উদ্দিন বলেছিলেন, ১৯৭২ সালে এক নির্বাহী আদেশে সরকারি, বেসরকারি, প্রতিরক্ষা, আধা সরকারি এবং জাতীয়করণ করা প্রতিষ্ঠানে জেলা ও জনসংখ্যার ভিত্তিতে ৩০ শতাংশ মুক্তিযোদ্ধা ও ১০ শতাংশ ক্ষতিগ্রস্ত নারীদের জন্য কোটা প্রবর্তন করা হয়। পরে বিভিন্ন সময়ে কোটায় সংস্কার ও পরিবর্তন করা হয়। বর্তমানে সব মিলিয়ে ৫৬ শতাংশ কোটা বিদ্যমান। ফলে যাঁরা কোনো কোটায় পড়েন না, তাঁদের প্রতিযোগিতা করতে হচ্ছে বাকি ৪৪ শতাংশের জন্য। ",
        timelineEventId: 6,
        date: "2018-01-31",
        url: "https://www.prothomalo.com/bangladesh/%E2%80%98%E0%A6%95%E0%A7%8B%E0%A6%9F%E0%A6%BE%E0%A6%B0-%E0%A6%95%E0%A7%8C%E0%A6%9F%E0%A6%BE%E0%A7%9F-%E0%A6%AC%E0%A6%A8%E0%A7%8D%E0%A6%A6%E0%A6%BF-%E0%A6%B6%E0%A6%BF%E0%A6%95%E0%A7%8D%E0%A6%B7%E0%A6%BF%E0%A6%A4-%E0%A6%AC%E0%A7%87%E0%A6%95%E0%A6%BE%E0%A6%B0%E2%80%99",
      },
    ],
  },
  {
    id: 7,
    title: "শনিবার, ১৭ ফেব্রুয়ারী, ২০১৮",
    date: "2018-02-17",
    items: [
      {
        id: 2,
        cardTitle: "কমিটি গঠন",
        cardSubtitle: "",
        cardDetailedText:
          "সরকারি চাকরিতে বিদ্যমান কোটাব্যবস্থা সংস্কারের পক্ষে-বিপক্ষে শাহবাগে জাতীয় জাদুঘরের সামনে পাল্টাপাল্টি কর্মসূচি পালন করেছে দুটি পক্ষ। ‘বাংলাদেশ সাধারণ ছাত্র সংরক্ষণ পরিষদের’ ব্যানারে কয়েক শ চাকরিপ্রার্থী কোটা সংস্কারের দাবিতে বিক্ষোভ করেন। আর সংস্কার প্রস্তাবের নামে ‘মুক্তিযোদ্ধা কোটার বিরুদ্ধে ষড়যন্ত্রের’ প্রতিবাদে মানববন্ধন করেন মুক্তিযোদ্ধা সংসদ সন্তান কমান্ডের নেতা-কর্মীরা। তবে পুলিশ সেখানে কাউকেই দাঁড়াতে দেয়নি।\n\nআন্দোলন চালিয়ে নিতে সন্ধ্যায় বিশ্ববিদ্যালয়ের বটতলায় ৭১ সদস্যবিশিষ্ট কমিটি গঠন করা হয়।",
        timelineEventId: 7,
        date: "2018-02-17",
        url: "https://www.prothomalo.com/bangladesh/%E0%A6%95%E0%A7%8B%E0%A6%9F%E0%A6%BE%E0%A6%B0-%E0%A6%AA%E0%A6%95%E0%A7%8D%E0%A6%B7%E0%A7%87-%E0%A6%93-%E0%A6%AC%E0%A6%BF%E0%A6%AA%E0%A6%95%E0%A7%8D%E0%A6%B7%E0%A7%87-%E0%A6%95%E0%A6%B0%E0%A7%8D%E0%A6%AE%E0%A6%B8%E0%A7%82%E0%A6%9A%E0%A6%BF",
      },
    ],
  },
  {
    id: 8,
    title: "রবিবার, ২৫ ফেব্রুয়ারী, ২০১৮",
    date: "2018-02-25",
    items: [
      {
        id: 3,
        cardTitle: "মানববন্ধন",
        cardSubtitle: "",
        cardDetailedText:
          "সরকারি চাকরিতে বিদ্যমান কোটাব্যবস্থার বিরুদ্ধে চাকরিপ্রার্থী ও বিশ্ববিদ্যালয়ের সাধারণ শিক্ষার্থীদের আন্দোলনের ধারাবাহিকতায় ২৫ ফেব্রুয়ারি মানববন্ধন কর্মসূচি পালিত হয়।",
        timelineEventId: 8,
        date: "2018-02-25",
        url: null,
      },
    ],
  },
  {
    id: 9,
    title: "রবিবার, ০৪ মার্চ, ২০১৮",
    date: "2018-03-04",
    items: [
      {
        id: 4,
        cardTitle: "মানববন্ধন",
        cardSubtitle: "",
        cardDetailedText:
          "৪ মার্চ মানববন্ধন কর্মসূচি শেষে আন্দোলনকারীরা ১৩ মার্চ পর্যন্ত সরকারকে কোটা সংস্কারের সময়সীমা বেঁধে দিয়েছিলেন। আন্দোলনকারীদের পাঁচ দফা দাবির মধ্যে রয়েছে কোটাব্যবস্থা সংস্কার করে ৫৬ ভাগ থেকে ১০ ভাগে নিয়ে আসা, কোটায় যোগ্য প্রার্থী পাওয়া না গেলে শূন্য থাকা পদগুলোতে মেধায় নিয়োগ দেওয়া, কোটায় কোনো ধরনের বিশেষ নিয়োগ পরীক্ষা না রাখা, সরকারি চাকরির ক্ষেত্রে সবার জন্য অভিন্ন বয়সসীমা নির্ধারণ এবং চাকরির নিয়োগ পরীক্ষায় কোটা-সুবিধা একাধিকবার ব্যবহার না করা।\n\nএদিন কেন্দ্রীয় কর্মসূচি হিসেবে বেলা দুইটার পরপর ঢাকা বিশ্ববিদ্যালয়ের কেন্দ্রীয় গ্রন্থাগারের সামনে থেকে হাজারো শিক্ষার্থী ও চাকরিপ্রার্থী গণপদযাত্রা করে বিভিন্ন রাস্তা ঘুরে বেলা তিনটায় শাহবাগ মোড়ে এসে অবস্থান নেন। আন্দোলনকারীরা ঘোষণা দেন, জাতীয় সংসদের অধিবেশন থেকে ঘোষণা না আসা পর্যন্ত অবরোধ চালিয়ে যাবেন। রাত পৌনে আটটায় আকস্মিকভাবে শিশুপার্কের দিক থেকে ১৫-২০ প্লাটুন দাঙ্গা পুলিশ কাঁদানে গ্যাস নিক্ষেপ করতে করতে শাহবাগ মোড়ের দিকে আসতে থাকে। তারা আন্দোলনকারীদের লাঠিপেটা শুরু করে। পুলিশের আকস্মিক হামলায় আন্দোলনকারীরা ছত্রভঙ্গ হয়ে দুই ভাগ হয়ে যান।\n\nএরপর থেকেই মূলত আন্দোলন ঘিরে সহিংসতা শুরু। বাংলাদেশ সাধারণ ছাত্র সংরক্ষণ পরিষদের নেতাদের ওপর বারবার হামলা করে ছাত্রলীগ। ফলে আন্দোলন ক্রমশ সহিংস হয়ে ওঠে।",
        timelineEventId: 9,
        date: "2018-03-04",
        url: null,
      },
    ],
  },
  {
    id: 10,
    title: "সোমবার, ০৯ এপ্রিল, ২০১৮",
    date: "2018-04-09",
    items: [
      {
        id: 5,
        cardTitle: "কোটা বাতিলের ঘোষণা",
        cardSubtitle: "",
        cardDetailedText:
          "জাতীয় সংসদে কোটা বাতিলের ঘোষণা দিলেন প্রধানমন্ত্রী শেখ হাসিনা।",
        timelineEventId: 10,
        date: "2018-04-09",
        url: "https://www.dw.com/bn/%E0%A6%95%E0%A7%8B%E0%A6%9F%E0%A6%BE-%E0%A6%AA%E0%A6%A6%E0%A7%8D%E0%A6%A7%E0%A6%A4%E0%A6%BF-%E0%A6%AC%E0%A6%BE%E0%A6%A4%E0%A6%BF%E0%A6%B2%E0%A7%87%E0%A6%B0-%E0%A6%98%E0%A7%8B%E0%A6%B7%E0%A6%A3%E0%A6%BE-%E0%A6%A6%E0%A6%BF%E0%A6%B2%E0%A7%87%E0%A6%A8-%E0%A6%AA%E0%A7%8D%E0%A6%B0%E0%A6%A7%E0%A6%BE%E0%A6%A8%E0%A6%AE%E0%A6%A8%E0%A7%8D%E0%A6%A4%E0%A7%8D%E0%A6%B0%E0%A7%80/a-43337003",
      },
    ],
  },
  {
    id: 11,
    title: "বৃহস্পতিবার, ০৪ অক্টোবর, ২০১৮",
    date: "2018-10-04",
    items: [
      {
        id: 6,
        cardTitle: " পরিপত্র জারি",
        cardSubtitle: "",
        cardDetailedText:
          "কোটা প্রথা বাতিল প্রসঙ্গে সরকারের পরিপত্র জারি।\n\nএরপর ২০২১ সালে এই পরিপত্র বাতিল চেয়ে কয়েকজন মুক্তিযোদ্ধার সন্তান রিট দায়ের করেন। রিটের প্রাথমিক শুনানি নিয়ে ২০২১ সালের ৬ ডিসেম্বর হাইকোর্ট রুল দেন। রুলে ওই পরিপত্র কেন আইনগত কর্তৃত্ববহির্ভূত ঘোষণা করা হবে না, সে বিষয়ে জানতে চাওয়া হয়।",
        timelineEventId: 11,
        date: "2018-10-04",
        url: "https://www.prothomalo.com/bangladesh/%E0%A6%AA%E0%A7%8D%E0%A6%B0%E0%A6%A5%E0%A6%AE-%E0%A6%93-%E0%A6%A6%E0%A7%8D%E0%A6%AC%E0%A6%BF%E0%A6%A4%E0%A7%80%E0%A7%9F-%E0%A6%B6%E0%A7%8D%E0%A6%B0%E0%A7%87%E0%A6%A3%E0%A6%BF%E0%A6%B0-%E0%A6%9A%E0%A6%BE%E0%A6%95%E0%A6%B0%E0%A6%BF%E0%A6%A4%E0%A7%87-%E0%A6%95%E0%A7%8B%E0%A6%9F%E0%A6%BE-%E0%A6%AC%E0%A6%BE%E0%A6%A4%E0%A6%BF%E0%A6%B2-%E0%A6%95%E0%A6%B0%E0%A7%87",
      },
    ],
  },
  {
    id: 12,
    title: "বুধবার, ০৫ জুন, ২০২৪",
    date: "2024-06-05",
    items: [
      {
        id: 7,
        cardTitle: "কোটা বাতিলের পরিপত্র অবৈধ ঘোষণা",
        cardSubtitle: "",
        cardDetailedText:
          "সরকারি দপ্তর, স্বায়ত্তশাসিত ও আধা স্বায়ত্তশাসিত প্রতিষ্ঠান এবং বিভিন্ন করপোরেশনের চাকরিতে সরাসরি নিয়োগের ক্ষেত্রে (৯ম থেকে ১৩তম গ্রেড) মুক্তিযোদ্ধা কোটা বাতিলের পরিপত্র অবৈধ ঘোষণা করে রায় প্রদান। এই রায়ের ফলে মুক্তিযোদ্ধা কোটায় ৯ম থেকে ১৩তম গ্রেডে নিয়োগ দেওয়ায় আর বাধা থাকল না। ",
        timelineEventId: 12,
        date: "2024-06-05",
        url: "https://www.prothomalo.com/chakri/chakri-news/8ud9luuwji",
      },
    ],
  },
  {
    id: 13,
    title: "বৃহস্পতিবার, ০৬ জুন, ২০২৪",
    date: "2024-06-06",
    items: [
      {
        id: 8,
        cardTitle: "আদালতের দেওয়া রায় বাতিলের দাবিতে বিক্ষোভ",
        cardSubtitle: "",
        cardDetailedText:
          "সরকারি চাকরিতে কোটাব্যবস্থা (মুক্তিযোদ্ধা কোটা) পুনর্বহালে আদালতের দেওয়া রায় বাতিলের দাবিতে ঢাকা বিশ্ববিদ্যালয়ে বিক্ষোভ। ‘সরকারি চাকরিতে ২০১৮ সালের পরিপত্র বাতিল করে কোটাপদ্ধতি পুনর্বহাল-সংক্রান্ত হাইকোর্টের রায়ের প্রতিবাদ জানিয়ে এবং চাকরিতে মেধাভিত্তিক নিয়োগ বহাল রাখার দাবিতে’ এ বিক্ষোভ সমাবেশের আয়োজন করা হয়। ‘ঢাকা বিশ্ববিদ্যালয়ের শিক্ষার্থীবৃন্দ’-এর ব্যানারে আয়োজিত এ কর্মসূচিতে বিপুলসংখ্যক শিক্ষার্থী অংশ নেন। ",
        timelineEventId: 13,
        date: "2024-06-06",
        url: "https://www.prothomalo.com/bangladesh/ddhmtlafqg",
      },
    ],
  },
  {
    id: 14,
    title: "রবিবার, ০৯ জুন, ২০২৪",
    date: "2024-06-09",
    items: [
      {
        id: 9,
        cardTitle: "আবারও বিক্ষোভ সমাবেশ",
        cardSubtitle: "",
        cardDetailedText:
          "সরকারি চাকরিতে কোটাব্যবস্থা পুনর্বহালের প্রতিবাদে আবারও বিক্ষোভ সমাবেশ করেন ঢাকা বিশ্ববিদ্যালয়ের শিক্ষার্থীরা। শিক্ষার্থীরা তাঁদের দাবি মানতে সরকারকে ৩০ জুন পর্যন্ত সময় বেঁধে দেন। এই সময়ের মধ্যে দাবি পূরণ না হলে সর্বাত্মক আন্দোলনের ঘোষণা দেন তাঁরা। একই দাবিতে চট্টগ্রাম ও বরিশাল বিশ্ববিদ্যালয়ের শিক্ষার্থীরাও আন্দোলন কর্মসূচি পালন করেন।\n\n‘ঢাকা বিশ্ববিদ্যালয়ের শিক্ষার্থীবৃন্দ’ ব্যানারে আয়োজিত কর্মসূচিতে বিপুলসংখ্যক শিক্ষার্থী অংশ নেন। বিক্ষোভ শেষে আন্দোলনকারীদের প্রতিনিধিদল সুপ্রিম কোর্টে অ্যাটর্নি জেনারেল বরাবর স্মারকলিপি দিতে যায়।\n\nএদিকে কোটা বাতিল-সংক্রান্ত হাইকোর্টের দেওয়া রায় স্থগিত চেয়ে রাষ্ট্রপক্ষের করা আবেদন আপিল বিভাগের পূর্ণাঙ্গ বেঞ্চে শুনানির জন্য ৪ জুলাই দিন নির্ধারণ করা হয়। ",
        timelineEventId: 14,
        date: "2024-06-09",
        url: "https://www.prothomalo.com/bangladesh/capital/qhzkd830rt",
      },
    ],
  },
  {
    id: 15,
    title: "সোমবার, ০১ জুলাই, ২০২৪",
    date: "2024-07-01",
    items: [
      {
        id: 10,
        cardTitle: "কোটা বাতিলের পরিপত্র পুনর্বহালের দাবিতে ছাত্রসমাবেশ",
        cardSubtitle: "",
        cardDetailedText:
          "কোটা বাতিলের পরিপত্র পুনর্বহালের দাবিতে ছাত্রসমাবেশ ও বিক্ষোভ অনুষ্ঠিত হয় ঢাকা বিশ্ববিদ্যালয়সহ দেশের বিভিন্ন বিশ্ববিদ্যালয়ে। ঢাকা বিশ্ববিদ্যালয়ে অনুষ্ঠিত সমাবেশে ৪ জুলাইয়ের মধ্যে দাবির বিষয়ে চূড়ান্ত সুরাহার আহ্বান জানানো হয়। এ সময় বৈষম্যবিরোধী ছাত্র আন্দোলনের পক্ষ থেকে তিন দিনের কর্মসূচির ঘোষণা দেওয়া হয়। কর্মসূচির মধ্যে ছিল, পরদিন মঙ্গলবার বেলা আড়াইটায় ঢাকা বিশ্ববিদ্যালয়ের কেন্দ্রীয় গ্রন্থাগার থেকে গণপদযাত্রা শুরু। আর বুধ ও বৃহস্পতিবার জগন্নাথ বিশ্ববিদ্যালয়, ঢাকা বিশ্ববিদ্যালয় অধিভুক্ত সাত সরকারি কলেজ এবং জাতীয় বিশ্ববিদ্যালয়ের অধীন ঢাকার অন্যান্য প্রতিষ্ঠানের শিক্ষার্থীরা রাজু ভাস্কর্যে একত্র হবেন বলে জানানো হয়। ",
        timelineEventId: 15,
        date: "2024-07-01",
        url: null,
      },
    ],
  },
  {
    id: 16,
    title: "মঙ্গলবার, ০২ জুলাই, ২০২৪",
    date: "2024-07-02",
    items: [
      {
        id: 11,
        cardTitle: "অবরোধ কর্মসূচি",
        cardSubtitle: "",
        cardDetailedText:
          "আন্দোলনকারীরা এই দিন বেলা পৌনে তিনটার দিকে ঢাকা বিশ্ববিদ্যালয় কেন্দ্রীয় গ্রন্থাগারের সামনে থেকে মিছিল করে নীলক্ষেত, সায়েন্স ল্যাবরেটরি ও বাটা সিগন্যাল মোড় ঘুরে শাহবাগে গিয়ে থামে। সেখানে তাঁরা এক ঘণ্টা অবরোধ কর্মসূচি পালন করেন। একই দিন বিকেলে জাহাঙ্গীরনগর বিশ্ববিদ্যালয়ের একদল শিক্ষার্থী ঢাকা-আরিচা ২০ মিনিটের জন্য অবরোধ করেন। ",
        timelineEventId: 16,
        date: "2024-07-02",
        url: null,
      },
    ],
  },
  {
    id: 17,
    title: "বুধবার, ০৩ জুলাই, ২০২৪",
    date: "2024-07-03",
    items: [
      {
        id: 12,
        cardTitle: "ঢাকার শাহবাগ মোড় অবরোধ",
        cardSubtitle: "",
        cardDetailedText:
          "এই দিন আন্দোলনকারীরা ঢাকার শাহবাগ মোড় দেড় ঘণ্টার মতো অবরোধ করে রাখেন। একই দাবিতে আরও ছয়টি বিশ্ববিদ্যালয়ের শিক্ষার্থীরা বিক্ষোভ ও অবরোধ করেন। এর মধ্যে ময়মনসিংহে রেললাইনে ট্রেন অবরোধ করে বিক্ষোভ করেন বাংলাদেশ কৃষি বিশ্ববিদ্যালয়ের শিক্ষার্থীরা, জাহাঙ্গীরনগর বিশ্ববিদ্যালয়ের শিক্ষার্থীরা ঢাকা-আরিচা মহাসড়ক, চট্টগ্রাম বিশ্ববিদ্যালয়ের শিক্ষার্থীরা চট্টগ্রাম-খাগড়াছড়ি মহাসড়ক এবং বরিশাল বিশ্ববিদ্যালয়ের শিক্ষার্থীরা বরিশাল-কুয়াকাটা মহাসড়ক অবরোধ করে বিক্ষোভ করেন। আর জগন্নাথ বিশ্ববিদ্যালয়ের চাকরিপ্রত্যাশী শিক্ষার্থীরা পুরান ঢাকার তাঁতীবাজার মোড়ে সড়ক অবরোধ করেন। বেলা তিনটা থেকে সাড়ে তিনটা পর্যন্ত এই অবরোধ কর্মসূচি পালন করা হয়। ",
        timelineEventId: 17,
        date: "2024-07-03",
        url: "https://www.prothomalo.com/bangladesh/xm2jadsjt6",
      },
    ],
  },
  {
    id: 18,
    title: "বৃহস্পতিবার, ০৪ জুলাই, ২০২৪",
    date: "2024-07-04",
    items: [
      {
        id: 13,
        cardTitle: "শুনানি পেছানো",
        cardSubtitle: "",
        cardDetailedText:
          "সরকারি চাকরিতে সরাসরি নিয়োগের ক্ষেত্রে মুক্তিযোদ্ধা কোটা বাতিলের পরিপত্র অবৈধ ঘোষণার বিষয়ে হাইকোর্টের রায় আপিল বিভাগে স্থগিত করেনি। প্রধান বিচারপতি ওবায়দুল হাসানের নেতৃত্বাধীন ছয় সদস্যের আপিল বিভাগ ‘নট টুডে’ বলে আদেশ দেন। পরের সপ্তাহে এ বিষয়ে শুনানি হতে পারে বলে ওই দিন অ্যাটর্নি জেনারেল কার্যালয় থেকে জানানো হয়।\n\nএ দিন শিক্ষার্থীরা দেশের বিভিন্ন মহাসড়ক অবরোধ করে। আর ঢাকায় শাহবাগ মোড় অবরোধ করে রাখে ৫ ঘণ্টা। এ দিন ছাত্র সমাবেশ থেকে ছাত্র ধর্মঘটের ডাক দেওয়া হয়।",
        timelineEventId: 18,
        date: "2024-07-04",
        url: "https://www.prothomalo.com/bangladesh/zl8omh8ad4",
      },
    ],
  },
  {
    id: 19,
    title: "শুক্রবার, ০৫ জুলাই, ২০২৪",
    date: "2024-07-05",
    items: [
      {
        id: 14,
        cardTitle: "সড়ক অবরোধ",
        cardSubtitle: "",
        cardDetailedText:
          "ছুটির দিন শুক্রবারেও বিক্ষোভ ও সড়ক অবরোধ করে আন্দোলনকারীরা। চট্টগ্রাম, খুলনা ও গোপালগঞ্জে সড়ক অবরোধ ",
        timelineEventId: 19,
        date: "2024-07-05",
        url: "https://www.prothomalo.com/bangladesh/district/trj1atr6ah",
      },
    ],
  },
  {
    id: 20,
    title: "শনিবার, ০৬ জুলাই, ২০২৪",
    date: "2024-07-06",
    items: [
      {
        id: 15,
        cardTitle: "অবরোধ কর্মসূচি",
        cardSubtitle: "",
        cardDetailedText:
          "দেশের বিভিন্ন বিশ্ববিদ্যালয়ে আগের দিনের মতোই বিক্ষোভ ও অবরোধ কর্মসূচি পালন করা হয়। এ সময় আন্দোলনকারীরা সব বিশ্ববিদ্যালয় ও কলেজে ক্লাস-পরীক্ষা বর্জন, ছাত্র ধর্মঘট এবং সারা দেশে সড়ক-মহাসড়ক অবরোধের ডাক দেন। এর নাম দেওয়া হয় ‘বাংলা ব্লকেড’। ",
        timelineEventId: 20,
        date: "2024-07-06",
        url: "https://www.prothomalo.com/video/bangladesh/zy5nnpghtx",
      },
    ],
  },
  {
    id: 21,
    title: "রবিবার, ০৭ জুলাই, ২০২৪",
    date: "2024-07-07",
    items: [
      {
        id: 16,
        cardTitle: "বাংলা ব্লকেড",
        cardSubtitle: "",
        cardDetailedText:
          "বাংলা ব্লকেডে স্থবির রাজধানী। অনির্দিষ্টকালের জন্য বিশ্ববিদ্যালয় ও কলেজে ক্লাস ও পরীক্ষা বর্জনের ঘোষণা। ",
        timelineEventId: 21,
        date: "2024-07-07",
        media: {
          title: 16,
          type: "IMAGE",
          source: {
            url: "https://images.prothomalo.com/prothomalo-bangla%2F2024-07%2Fa129289d-9332-4870-8587-763729696b0f%2F%E0%A7%A8.PNG",
          },
          text: 16,
        },
        url: "https://www.prothomalo.com/bangladesh/lp03yemwer",
      },
    ],
  },
  {
    id: 22,
    title: "সোমবার, ০৮ জুলাই, ২০২৪",
    date: "2024-07-08",
    items: [
      {
        id: 17,
        cardTitle: " ‘বৈষম্যবিরোধী ছাত্র আন্দোলন’",
        cardSubtitle: "",
        cardDetailedText:
          "ঢাকার ১১টি স্থানে অবরোধ, ৯টি বিশ্ববিদ্যালয়ে বিক্ষোভ, ৩টি স্থানে রেলপথ অবরোধ এবং ৬টি মহাসড়ক অবরোধ। সরকারি চাকরিতে সব গ্রেডে অযৌক্তিক ও বৈষম্যমূলক কোটা বাতিল করে শুধু সংবিধান অনুযায়ী অনগ্রসর জনগোষ্ঠীর জন্য ন্যূনতম কোটা রেখে সংসদে আইন পাসের দাবি।\n\nকোটাবৈষম্যের বিরুদ্ধে ও স্থায়ী সমাধানের দাবিতে ‘বৈষম্যবিরোধী ছাত্র আন্দোলন’ নামে ৬৫ সদস্যের সমন্বয়ক টিম গঠন।\n\nসমন্বয়ক কমিটির সদস্য নাহিদ ইসলাম চার দফা দাবির পরিবর্তে এক দফা দাবির কথা বলেন। দাবিটি হলো, সরকারি চাকরিতে সব গ্রেডে অযৌক্তিক ও বৈষম্যমূলক কোটা বাতিল করে শুধু সংবিধান অনুযায়ী অনগ্রসর জনগোষ্ঠীর জন্য ন্যূনতম কোটা রেখে সংসদে আইন পাস করা। নাহিদ এ সময় আরও বলেন, ‘আমরা আমাদের এক দফা দাবি দিয়ে দিয়েছি, যেখানে আদালতের কোনো এখতিয়ার নেই। এটা করার দায়িত্ব কেবল নির্বাহী বিভাগ ও সরকারের। ফলে বল এখন সরকারের কোর্টে। এখন আর আদালত দেখিয়ে কোনো লাভ নেই। সরকারই ঠিক করতে পারে, এই আন্দোলনের গতিপথ কী হবে।’ ",
        timelineEventId: 22,
        date: "2024-07-08",
        url: null,
      },
    ],
  },
  {
    id: 23,
    title: "মঙ্গলবার, ০৯ জুলাই, ২০২৪",
    date: "2024-07-09",
    items: [
      {
        id: 18,
        cardTitle: "চার ঘণ্টা অবরোধ ",
        cardSubtitle: "",
        cardDetailedText:
          "হাইকোর্টের রায় স্থগিত চেয়ে দুই শিক্ষার্থীর আবেদন। শুনানি হবে পরদিন। অবশ্য ওই দুই শিক্ষার্থীর আবেদন করার সঙ্গে কোটাবিরোধী আন্দোলনকারীদের কোনো সম্পর্ক নেই বলে দাবি করে বৈষম্যবিরোধী ছাত্র আন্দোলন।\n\nআন্দোলনের অংশ হিসেবে শিক্ষার্থী ও চাকরিপ্রত্যাশীরা চার ঘণ্টা পর অবরোধ তুলে নেন। আন্দোলনকারীদের পক্ষ থেকে পরদিন সারা দেশে সকাল-সন্ধ্যা ‘বাংলা ব্লকেড’ নামে অবরোধ কর্মসূচির ঘোষণা দেওয়া হয়।",
        timelineEventId: 23,
        date: "2024-07-09",
        url: null,
      },
    ],
  },
  {
    id: 24,
    title: "বুধবার, ১০ জুলাই, ২০২৪",
    date: "2024-07-10",
    items: [
      {
        id: 19,
        cardTitle:
          "চার সপ্তাহের জন্য স্থিতাবস্থা বজায় রাখতে নির্দেশ আপিল বিভাগের",
        cardSubtitle: "",
        cardDetailedText:
          "সরকারি চাকরিতে সরাসরি নিয়োগে (৯ম থেকে ১৩তম গ্রেড) কোটার বিষয়ে পক্ষগুলোকে চার সপ্তাহের জন্য স্থিতাবস্থা বজায় রাখতে নির্দেশ আপিল বিভাগের। প্রধান বিচারপতি ওবায়দুল হাসানের নেতৃত্বাধীন পাঁচ সদস্যের আপিল বিভাগ এ আদেশ দেন। শুনানির জন্য আগামী ৭ আগস্ট দিন রাখা হয়।\n\nশুনানির একপর্যায়ে প্রধান বিচারপতি ওবায়দুল হাসান বলেন, ‘আমরা এই সমাজের মানুষ, কিছু কথা বলতেই হয়। সেটি হচ্ছে যে একটা রায় হাইকোর্টে হয়ে গেছে। ছাত্রছাত্রীরা আন্দোলন করছে। সেখানে তারা যেটা করেছে, এটা অ্যাপ্রিশিয়েট (প্রশংসা) করার মতো না। মনে হয়, তারা ভুল বুঝেই করেছে। যা-ই হোক যেটিই করেছে, তারা আমাদেরই ছেলে-মেয়ে।’\n\nপ্রধান বিচারপতি আরও বলেন, ‘আমি প্রথম দিনই বলেছিলাম, রাস্তায় স্লোগান দিয়ে রায় পরিবর্তন হয় না। এটা আজকে না, আমি যখন আন্তর্জাতিক অপরাধ ট্রাইব্যুনালে ছিলাম, তখন একটি মামলায় বলেছিলাম, রাস্তায় স্লোগান দিয়ে রায় পরিবর্তন করা যায় না। এটি সঠিক পদক্ষেপ না।’\n\nঅন্যদিকে সরকারি চাকরির সব পদে কোটা সংস্কারের দাবি করেন আন্দোলনকারী শিক্ষার্থী ও চাকরিপ্রত্যাশীরা। তাঁরা মনে করছেন, এটি সরকারের সিদ্ধান্তের বিষয়।",
        timelineEventId: 24,
        date: "2024-07-10",
        url: null,
      },
    ],
  },
  {
    id: 25,
    title: "বৃহস্পতিবার, ১১ জুলাই, ২০২৪",
    date: "2024-07-11",
    items: [
      {
        id: 20,
        cardTitle: "দেশের বিভিন্ন স্থানে অবরোধ পালন করেন আন্দোলনকারীরা",
        cardSubtitle: "",
        cardDetailedText:
          "আওয়ামী লীগের সাধারণ সম্পাদক ওবায়দুল কাদের বলেন, কোটাবিরোধী আন্দোলনকারীরা সর্বোচ্চ আদালতের বিরুদ্ধে শক্তি প্রদর্শন করছেন। এটি অনভিপ্রেত ও সম্পূর্ণ বেআইনি। ধানমন্ডিতে আওয়ামী লীগ সভাপতি শেখ হাসিনার রাজনৈতিক কার্যালয়ে এক সংবাদ সম্মেলনে এসব কথা বলেন ওবায়দুল কাদের।\n\nসচিবালয়ে এক সংবাদ সম্মেলনে স্বরাষ্ট্রমন্ত্রী আসাদুজ্জামান খান বলেন, শিক্ষার্থীরা ‘লিমিট ক্রস’ করে যাচ্ছেন।\n\nএ দিন পুলিশের বাধার মুখেই দেশের বিভিন্ন স্থানে অবরোধ পালন করেন আন্দোলনকারীরা।\n",
        timelineEventId: 25,
        date: "2024-07-11",
        url: null,
      },
    ],
  },
  {
    id: 26,
    title: "শুক্রবার, ১২ জুলাই, ২০২৪",
    date: "2024-07-12",
    items: [
      {
        id: 21,
        cardTitle: " ছুটির দিনেও বিক্ষোভ",
        cardSubtitle: "",
        cardDetailedText:
          "কোটা সংস্কারের দাবিতে শুক্রবার ছুটির দিনেও দেশের বিভিন্ন বিশ্ববিদ্যালয় ও কলেজ ক্যাম্পাসে বিক্ষোভ করেন শিক্ষার্থীরা। ঢাকা বিশ্ববিদ্যালয়ে মিছিল শেষে শিক্ষার্থীরা শাহবাগ মোড় অবরোধ করেন। রেলপথ অবরোধ করেন রাজশাহী বিশ্ববিদ্যালয়ের শিক্ষার্থীরা।",
        timelineEventId: 26,
        date: "2024-07-12",
        url: null,
      },
    ],
  },
  {
    id: 27,
    title: "শনিবার, ১৩ জুলাই, ২০২৪",
    date: "2024-07-13",
    items: [
      {
        id: 22,
        cardTitle: " স্মারকলিপি দেওয়ার কর্মসূচি ঘোষণা",
        cardSubtitle: "",
        cardDetailedText:
          "সব গ্রেডে কোটার যৌক্তিক সংস্কারের দাবিতে রাষ্ট্রপতির কাছে স্মারকলিপি দেওয়ার কর্মসূচি ঘোষণা। পরের দিন রোববার গণপদযাত্রা করে রাষ্ট্রপতি বরাবর এ স্মারকলিপি দেবেন আন্দোলনকারীরা।",
        timelineEventId: 27,
        date: "2024-07-13",
        url: null,
      },
      {
        id: 23,
        cardTitle: "মোহাম্মদ আলী আরাফাত",
        cardSubtitle: "",
        cardDetailedText:
          "তথ্য প্রতিমন্ত্রী মোহাম্মদ আলী আরাফাত বলেন, বিচারাধীন বিষয়ে সরকারের এখন কিছু করার নেই।",
        timelineEventId: 27,
        date: "2024-07-13",
        url: null,
      },
    ],
  },
  {
    id: 28,
    title: "রবিবার, ১৪ জুলাই, ২০২৪",
    date: "2024-07-14",
    items: [
      {
        id: 24,
        cardTitle: "প্রধানমন্ত্রী শেখ হাসিনা",
        cardSubtitle: "",
        cardDetailedText:
          "গণভবনে অনুষ্ঠিত সংবাদ সম্মেলনে প্রধানমন্ত্রী শেখ হাসিনা বললেন, ‘কোটা বিষয়ে আমার কিছু করার নেই।’ তিনি আরও বলেন, ‘মামলার পর আদালত যে রায় দেন, এতে নির্বাহী বিভাগের কিছু করার নেই। আদালতেই সমাধান করতে হবে।’ শেখ হাসিনা আরেক প্রশ্নের জবাবে বলেন, ‘মুক্তিযোদ্ধাদের নাতি-পুতিরা পাবে না, তাহলে কি রাজাকারের নাতি-পুতিরা চাকরি পাবে?’\n\n২০১৮ সালের আন্দোলন প্রসঙ্গে প্রধানমন্ত্রী জানান, সে সময়ে তিনি বিরক্ত হয়ে কোটা বাতিল করে দিয়েছিলেন। উদ্দেশ্য ছিল কোটা বাতিল হলে কী হয় সেটি দেখা। এ সময় বিসিএসে নারীরা বাদ পড়েছেন, ২৩টি জেলার কেউ পুলিশে চাকরি পাননি।",
        timelineEventId: 28,
        date: "2024-07-14",
        url: null,
      },
      {
        id: 25,
        cardTitle: "সংস্কারের দাবি",
        cardSubtitle: "",
        cardDetailedText:
          "একই দিনে পদযাত্রা কর্মসূচির মধ্য দিয়ে রাষ্ট্রপতির কাছে স্মারকলিপি দিয়ে আন্দোলনকারীরা জাতীয় সংসদে জরুরি অধিবেশন ডেকে সরকারি চাকরির সব গ্রেডের কোটার যৌক্তিক সংস্কারের দাবিতে সরকারকে ২৪ ঘণ্টার সময় বেঁধে দেন।",
        timelineEventId: 28,
        date: "2024-07-14",
        url: null,
      },
      {
        id: 26,
        cardTitle: "রাজাকার! রাজাকার!! ",
        cardSubtitle: "",
        cardDetailedText:
          "মধ্যরাতে সরকারি চাকরিতে কোটাব্যবস্থা সংস্কারের দাবিতে আন্দোলনকারীদের অবমাননা করা হয়েছে দাবি করে ঢাকা বিশ্ববিদ্যালয় ক্যাম্পাসে বিক্ষোভ করেন শিক্ষার্থীরা। চট্টগ্রাম বিশ্ববিদ্যালয়ে শিক্ষার্থীরা বিক্ষোভ শুরু করলে হামলা চালায় ছাত্রলীগ। মিছিল হয়েছে জাহাঙ্গীরনগর ও জগন্নাথ বিশ্ববিদ্যালয়েও।\n\nরাত ১০টা থেকে ঢাকা বিশ্ববিদ্যালয়ের বিভিন্ন আবাসিক হলে বিক্ষোভের পর মধ্যরাতে শিক্ষার্থীরা জড়ো হন টিএসসির রাজু ভাস্কর্যে। জমায়েতে শিক্ষার্থীরা ‘চেয়েছিলাম অধিকার, হয়ে গেলাম রাজাকার’সহ নানা ধরনের স্লোগান দেন।",
        timelineEventId: 28,
        date: "2024-07-14",
        url: null,
      },
    ],
  },
  {
    id: 29,
    title: "সোমবার, ১৫ জুলাই, ২০২৪",
    date: "2024-07-15",
    items: [
      {
        id: 27,
        cardTitle: "ওবায়দুল কাদের",
        cardSubtitle: "",
        cardDetailedText:
          "বেলা দুইটায় রাজধানীর ধানমন্ডিতে আওয়ামী লীগ সভাপতির রাজনৈতিক কার্যালয়ে আয়োজিত সংবাদ সম্মেলনে দুপুর দুইটায় কোটা সংস্কারের দাবিতে আন্দোলনকারীদের ‘রাজাকার’ স্লোগানের জবাব ছাত্রলীগই দেবে বলে মন্তব্য করেন আওয়ামী লীগের সাধারণ সম্পাদক ওবায়দুল কাদের। তিনি বলেন, আন্দোলন থেকে আত্মস্বীকৃত রাজাকার ও ঔদ্ধত্যপূর্ণ মানসিকতা বা আচরণের প্রকাশ ঘটেছে। এর জবাব দেওয়ার জন্য ছাত্রলীগ প্রস্তুত।",
        timelineEventId: 29,
        date: "2024-07-15",
        url: null,
      },
      {
        id: 28,
        cardTitle: "সাদ্দাম হোসেন",
        cardSubtitle: "",
        cardDetailedText:
          "দুপুরে কোটা সংস্কার আন্দোলনে যাঁরা ‘আমি রাজাকার’ স্লোগান দিচ্ছেন, তাঁদের শেষ দেখিয়ে ছাড়বেন বলে মন্তব্য করেন বাংলাদেশ ছাত্রলীগের কেন্দ্রীয় সভাপতি সাদ্দাম হোসেন।",
        timelineEventId: 29,
        date: "2024-07-15",
        url: null,
      },
      {
        id: 29,
        cardTitle: "সংঘর্ষ",
        cardSubtitle: "",
        cardDetailedText:
          "বেলা তিনটায় ঢাকা বিশ্ববিদ্যালয়ে দফায় দফায় ছাত্রলীগ ও আন্দোলনকারীদের মধ্যে সংঘর্ষ বাধে। এ সময় আন্দোলনকারীদের মারধর করা হয়। গুলি করতেও দেখা যায়। দেশের বিভিন্ন স্থানে হামলা হয়। আহত ২৯৭ জন ঢাকা মেডিকেলে চিকিৎসা নেন।",
        timelineEventId: 29,
        date: "2024-07-15",
        url: null,
      },
    ],
  },
  {
    id: 30,
    title: "মঙ্গলবার, ১৬ জুলাই, ২০২৪",
    date: "2024-07-16",
    items: [
      {
        id: 30,
        cardTitle: "আবু সাঈদ",
        cardSubtitle: "",
        cardDetailedText:
          "রংপুরে আন্দোলনকারী বেগম রোকেয়া বিশ্ববিদ্যালয়ের শিক্ষার্থী আবু সাঈদ পুলিশের বুলেটে নিহত হওয়ার সচিত্র ছবি প্রকাশ।",
        timelineEventId: 30,
        date: "2024-07-16",
        media: {
          title: 30,
          type: "IMAGE",
          source: {
            url: "https://images.prothomalo.com/prothomalo-bangla%2F2024-07%2F53befdf1-0423-4d8a-82dd-99589ce2c048%2FAbu-sayed.jpg",
          },
          text: 30,
        },
        url: "https://images.prothomalo.com/prothomalo-bangla%2F2024-07%2Fcb3cf5a5-be79-4ccc-84cd-ea2af80f7b7c%2F7c9f14dc-124f-465b-adad-043cb8d29360.jfif?auto=format%2Ccompress&fmt=webp&format=webp&w=1920&dpr=1.0",
      },
      {
        id: 31,
        cardTitle: "ছাত্রলীগের কেন্দ্রীয় সভাপতি সাদ্দাম হোসেন",
        cardSubtitle: "",
        cardDetailedText:
          "বিকেলে ছাত্রলীগের কেন্দ্রীয় সভাপতি সাদ্দাম হোসেন বলেন, ‘আন্দোলন যাবে, আন্দোলন আসবে। কিন্তু ছাত্রলীগ থাকবে। সবকিছুই মনে রাখা হবে এবং জবাব দেওয়া হবে। একটি ঘটনাও জবাব ছাড়া যাবে না। রাজাকারদের ফাঁদে পড়ে ইস্যুভিত্তিক আন্দোলনকে ভিন্ন খাতে প্রবাহিত করার চেষ্টা করলে ভবিষ্যতে আমরা দেখে নেব, কত ধানে কত চাল হয়।’",
        timelineEventId: 30,
        date: "2024-07-16",
        url: null,
      },
      {
        id: 32,
        cardTitle: "নতুন কর্মসূচি",
        cardSubtitle: "",
        cardDetailedText:
          "আন্দোলনকারী শিক্ষার্থীদের নতুন কর্মসূচি। নিহত ব্যক্তিদের স্মরণে বুধবার গায়েবানা জানাজা ও কফিন মিছিল করবেন তাঁরা।",
        timelineEventId: 30,
        date: "2024-07-16",
        url: null,
      },
    ],
  },
  {
    id: 31,
    title: "বুধবার, ১৭ জুলাই, ২০২৪",
    date: "2024-07-17",
    items: [
      {
        id: 33,
        cardTitle: "ঢাকা বিশ্ববিদ্যালয় ‘রাজনীতিমুক্ত’ ঘোষণা",
        cardSubtitle: "",
        cardDetailedText:
          "ঢাকা বিশ্ববিদ্যালয়সহ দেশের বিভিন্ন বিশ্ববিদ্যালয় থেকে ছাত্রলীগের নেতা-কর্মীদের বিতাড়ন করে ‘রাজনীতিমুক্ত’ ঘোষণা।",
        timelineEventId: 31,
        date: "2024-07-17",
        url: "https://www.prothomalo.com/bangladesh/capital/1l2iyqob9m",
      },
      {
        id: 34,
        cardTitle: "কফিন মিছিল",
        cardSubtitle: "",
        cardDetailedText:
          "পুলিশের কাঁদানে গ্যাসের শেল ও সাউন্ড গ্রেনেড নিক্ষেপের মুখে ঢাকা বিশ্ববিদ্যালয়ে শিক্ষার্থীদের কফিন মিছিল পণ্ড হয়ে যায়। এ সময় পুলিশের সঙ্গে ছাত্রদের দফায় দফায় পাল্টাপাল্টি ধাওয়া ও সংঘর্ষের ঘটনা ঘটে।",
        timelineEventId: 31,
        date: "2024-07-17",
        media: {
          title: 34,
          type: "IMAGE",
          source: {
            url: "https://images.prothomalo.com/prothomalo-bangla%2F2024-07%2Fb6098ba0-ee96-4f8e-9b02-6b436e301db2%2F6.JPG",
          },
          text: 34,
        },
        url: "https://www.prothomalo.com/photo/bangladesh/hxltcihkjx",
      },
      {
        id: 35,
        cardTitle: "হল বন্ধের ঘোষণা",
        cardSubtitle: "",
        cardDetailedText:
          "বিশ্ববিদ্যালয় প্রশাসনের হল বন্ধের ঘোষণা ও পুলিশের তৎপরতার মুখে অনেক শিক্ষার্থী সন্ধ্যা নাগাদ ক্যাম্পাস ছেড়ে যান। তবে হল বন্ধের সিদ্ধান্ত প্রত্যাখ্যান করে রাতেও অনেক ছাত্রছাত্রী হল ও ক্যাম্পাসে অবস্থান করছিলেন।",
        timelineEventId: 31,
        date: "2024-07-17",
        url: "https://www.prothomalo.com/bangladesh/capital/xq1zadx1tn",
      },
      {
        id: 36,
        cardTitle: "জাতির উদ্দেশে প্রধানমন্ত্রীর ভাষণ",
        cardSubtitle: "",
        cardDetailedText:
          "রাত সাড়ে সাতটায় জাতির উদ্দেশে প্রধানমন্ত্রীর ভাষণ। ছয়জন নিহত হওয়ার ঘটনায় বিচার বিভাগীয় তদন্তের নির্দেশ। একই সঙ্গে তিনি আন্দোলনকারীদের সর্বোচ্চ আদালতের রায় আসা পর্যন্ত ধৈর্য ধরার আহ্বান জানান।\n\nপ্রায় আট মিনিটের ভাষণে প্রধানমন্ত্রী বলেন, ‘আমার বিশ্বাস, আমাদের ছাত্রসমাজ উচ্চ আদালত থেকে ন্যায়বিচারই পাবে, তাদের হতাশ হতে হবে না।’",
        timelineEventId: 31,
        date: "2024-07-17",
        media: {
          title: 36,
          type: "IMAGE",
          source: {
            url: "https://images.prothomalo.com/prothomalo-bangla%2F2024-07%2F145d488f-c069-45b4-bbe6-4194abe89862%2FPM-Address-01.jpg",
          },
          text: 36,
        },
        url: null,
      },
    ],
  },
  {
    id: 32,
    title: "বৃহস্পতিবার, ১৮ জুলাই, ২০২৪",
    date: "2024-07-18",
    items: [
      {
        id: 37,
        cardTitle: "প্রতিরোধ, সহিংসতা, সংঘর্ষ",
        cardSubtitle: "",
        cardDetailedText:
          "দেশব্যাপী প্রতিরোধ, সহিংসতা, সংঘর্ষ ও গুলি\n\nআন্দোলনকারী শিক্ষার্থীদের সর্বাত্মক অবরোধ কর্মসূচিকে কেন্দ্র করে ঢাকাসহ সারা দেশ ছিল প্রায় অচল। রাজধানী ছাড়াও দেশের ৪৭টি জেলায় দিনভর বিক্ষোভ, অবরোধ, পাল্টাপাল্টি ধাওয়া, পুলিশের হামলা-গুলি ও সংঘাতের ঘটনা ঘটে। এসব ঘটনায় আহত হয়েছেন অন্তত দেড় হাজার। কোথাও কোথাও আন্দোলনকারীদের সঙ্গে আইনশৃঙ্খলা রক্ষাকারী বাহিনীর সদস্যদের, আবার কোথাও সরকার-সমর্থক বিভিন্ন সংগঠনের নেতা-কর্মীদের সংঘর্ষ হয়।",
        timelineEventId: 32,
        date: "2024-07-18",
        url: null,
      },
    ],
  },
  {
    id: 33,
    title: "শুক্রবার, ১৯ জুলাই, ২০২৪",
    date: "2024-07-19",
    items: [
      {
        id: 38,
        cardTitle: "কমপ্লিট শাটডাউন",
        cardSubtitle: "",
        cardDetailedText:
          "কোটা সংস্কারের দাবিতে আন্দোলনরত শিক্ষার্থীদের ‘কমপ্লিট শাটডাউন’ বা সর্বাত্মক অবরোধের কর্মসূচি ঘিরে রাজধানী ঢাকায় ব্যাপক সংঘর্ষ, হামলা, ভাঙচুর, গুলি, অগ্নিসংযোগ ও প্রাণহানির ঘটনা ঘটে। রাজধানী ঢাকা ছিল কার্যত অচল, পরিস্থিতি ছিল থমথমে। দেশের বিভিন্ন জেলাতেও ব্যাপক বিক্ষোভ, সংঘর্ষ ও সহিংসতা হয়।",
        timelineEventId: 33,
        date: "2024-07-19",
        url: "https://www.prothomalo.com/bangladesh/derc2mncxq",
      },
    ],
  },
  {
    id: 34,
    title: "শনিবার, ২০ জুলাই, ২০২৪",
    date: "2024-07-20",
    items: [
      {
        id: 39,
        cardTitle: "দেশজুড়ে কারফিউ, সেনা মোতায়েন",
        cardSubtitle: "",
        cardDetailedText:
          "রাজধানীর বিভিন্ন স্থানে সংঘর্ষ, ধাওয়া ও গুলি। উল্লেখযোগ্য স্থান হচ্ছে, যাত্রাবাড়ী, উত্তরা, বাড্ডা ও মিরপুর। এ ছাড়া মোহাম্মদপুরেও সংঘর্ষের ঘটনা ঘটে। সংঘর্ষে শনিবার নিহত ২৬। সব মিলিয়ে চার দিনে নিহত ১৪৮। এর মধ্যে মঙ্গলবার ৬ জন, বৃহস্পতিবার ৪১ জন, শুক্রবার ৭৫ জন এবং শনিবার ২৬ জন।",
        timelineEventId: 34,
        date: "2024-07-20",
        url: null,
      },
      {
        id: 40,
        cardTitle: "আট দফা দাবি পেশ",
        cardSubtitle: "",
        cardDetailedText:
          "আন্দোলনের তিন সমন্বয়ক তিন মন্ত্রীর সঙ্গে দেখা করে আট দফা দাবি পেশ।",
        timelineEventId: 34,
        date: "2024-07-20",
        url: null,
      },
      {
        id: 41,
        cardTitle: "নাহিদ ইসলামকে তুলে নেওয়া",
        cardSubtitle: "",
        cardDetailedText:
          "স্বরাষ্ট্রমন্ত্রী বলেন, পরিস্থিতি স্বাভাবিক না হওয়া পর্যন্ত কারফিউ চলবে। ‘বৈষম্যবিরোধী ছাত্র আন্দোলনের’ অন্যতম সমন্বয়ক নাহিদ ইসলামকে তুলে নেওয়ার অভিযোগ।",
        timelineEventId: 34,
        date: "2024-07-20",
        url: null,
      },
      {
        id: 42,
        cardTitle: "মেট্রো স্টেশনে আগুন",
        cardSubtitle: "",
        cardDetailedText:
          "কাজীপাড়া ও মিরপুর-১০ নম্বর মেট্রো স্টেশনে বিপুল ক্ষতি। গত শুক্রবার সরকারি তিন স্থাপনায় আগুনে ১১৩ যানবাহন পুড়ে ছাই হওয়ার খবর।",
        timelineEventId: 34,
        date: "2024-07-20",
        url: null,
      },
    ],
  },
  {
    id: 35,
    title: "রবিবার, ২১ জুলাই, ২০২৪",
    date: "2024-07-21",
    items: [
      {
        id: 43,
        cardTitle: "হাইকোর্টের রায় বাতিল",
        cardSubtitle: "",
        cardDetailedText:
          "সরকারি চাকরিতে নিয়োগের ক্ষেত্রে কোটা পুনর্বহাল-সংক্রান্ত হাইকোর্টের রায় সামগ্রিকভাবে বাতিল (রদ ও রহিত) করে দেশের সর্বোচ্চ আদালতের রায় প্রদান। রায়ে বলা হয়, কোটাপ্রথা হিসেবে মেধাভিত্তিক ৯৩ শতাংশ; মুক্তিযোদ্ধা, শহীদ মুক্তিযোদ্ধা ও বীরাঙ্গনার সন্তানদের জন্য ৫ শতাংশ; ক্ষুদ্র নৃগোষ্ঠী ১ শতাংশ এবং প্রতিবন্ধী ও তৃতীয় লিঙ্গের জন্য ১ শতাংশ নির্ধারণ করা হলো। তবে নির্ধারিত কোটায় যোগ্য প্রার্থী না পাওয়া গেলে সংশ্লিষ্ট কোটার শূন্য পদগুলো সাধারণ মেধাতালিকা থেকে পূরণ করতে হবে। এই নির্দেশনার আলোকে সরকারের নির্বাহী বিভাগকে অনতিবিলম্বে প্রজ্ঞাপন জারি করতে নির্দেশ দেন আপিল বিভাগ।\n\nপ্রধান বিচারপতি ওবায়দুল হাসানের নেতৃত্বাধীন সাত সদস্যের আপিল বিভাগের পূর্ণাঙ্গ বেঞ্চ সর্বসম্মতিতে এ রায় দেন। রায়ে বলা হয়, এই নির্দেশনা ও আদেশ সত্ত্বেও সরকার প্রয়োজনে ও সার্বিক বিবেচনায় নির্ধারিত কোটা বাতিল, সংশোধন বা সংস্কার করতে পারবে।",
        timelineEventId: 35,
        date: "2024-07-21",
        url: null,
      },
    ],
  },
  {
    id: 36,
    title: "সোমবার, ২২ জুলাই, ২০২৪",
    date: "2024-07-22",
    items: [
      {
        id: 44,
        cardTitle: "প্রজ্ঞাপন অনুমোদন",
        cardSubtitle: "",
        cardDetailedText:
          "কোটাপ্রথা সংস্কার করে আদালতের নির্দেশ অনুযায়ী তৈরি করা প্রজ্ঞাপন অনুমোদন দিয়েছেন প্রধানমন্ত্রী।",
        timelineEventId: 36,
        date: "2024-07-22",
        url: null,
      },
    ],
  },
  {
    id: 37,
    title: "মঙ্গলবার, ২৩ জুলাই, ২০২৪",
    date: "2024-07-23",
    items: [
      {
        id: 45,
        cardTitle: "প্রজ্ঞাপন জারি",
        cardSubtitle: "",
        cardDetailedText: "কোটাপ্রথা সংস্কার করে প্রজ্ঞাপন জারি।",
        timelineEventId: 37,
        date: "2024-07-23",
        url: null,
      },
      {
        id: 46,
        cardTitle: "ব্রডব্যান্ড ইন্টারনেট চালু",
        cardSubtitle: "",
        cardDetailedText: "রাতে সীমিত আকারে ব্রডব্যান্ড ইন্টারনেট সেবা চালু",
        timelineEventId: 37,
        date: "2024-07-23",
        url: null,
      },
    ],
  },
  {
    id: 38,
    title: "শুক্রবার, ২৬ জুলাই, ২০২৪",
    date: "2024-07-26",
    items: [
      {
        id: 47,
        cardTitle: "নাহিদসহ তিন সমন্বয়ককে হাসপাতাল থেকে তুলে নেওয়া হয়েছে",
        cardSubtitle: "",
        cardDetailedText:
          "নাহিদ ইসলামসহ কোটা সংস্কার আন্দোলনের তিন সমন্বয়ককে রাজধানীর গণস্বাস্থ্য নগর হাসপাতাল থেকে তুলে নিয়ে গেছেন সাদাপোশাকের এক দল ব্যক্তি। তাঁরা নিজেদের আইনশৃঙ্খলা রক্ষাকারী বাহিনীর সদস্য পরিচয় দিয়েছেন বলে সেখানে উপস্থিত এক সমন্বয়কের স্বজন ও হাসপাতালের চিকিৎসকেরা জানিয়েছেন।",
        timelineEventId: 38,
        date: "2024-07-26",
        media: {
          title: 47,
          type: "IMAGE",
          source: {
            url: "https://images.prothomalo.com/prothomalo-bangla%2F2024-07%2F9213fad9-db5a-4666-9172-5316a3573f20%2FNahid.jpg",
          },
          text: 47,
        },
        url: "https://www.prothomalo.com/bangladesh/esa3xe0a20",
      },
    ],
  },
  {
    id: 39,
    title: "শনিবার, ২৭ জুলাই, ২০২৪",
    date: "2024-07-27",
    items: [
      {
        id: 48,
        cardTitle:
          " বৈষম্যবিরোধী ছাত্র আন্দোলন সংগঠনের আরও দুই সমন্বয়ক হেফাজতে",
        cardSubtitle: "",
        cardDetailedText:
          "বৈষম্যবিরোধী ছাত্র আন্দোলন সংগঠনের আরও দুই সমন্বয়ককে হেফাজতে নেয় গোয়েন্দা শাখা। তারা হলেন সারজিস আলম ও হাসনাত আবদুল্লাহ",
        timelineEventId: 39,
        date: "2024-07-27",
        url: "https://www.prothomalo.com/bangladesh/9bwwnj24pr",
      },
    ],
  },
  {
    id: 40,
    title: "বুধবার, ৩১ জুলাই, ২০২৪",
    date: "2024-07-31",
    items: [
      {
        id: 49,
        cardTitle: "‘মার্চ ফর জাস্টিস’ কর্মসূচি",
        cardSubtitle: "",
        cardDetailedText:
          " হত্যা, গণগ্রেপ্তার, হামলা, মামলা ও গুমের প্রতিবাদে ৩১ জুলাই বুধবার সারাদেশে বৈষম্যবিরোধী ছাত্র আন্দোলন ‘মার্চ ফর জাস্টিস’ (ন্যায়বিচারের জন্য পদযাত্রা) কর্মসূচি পালন করে",
        timelineEventId: 40,
        date: "2024-07-31",
        media: {
          title: 49,
          type: "IMAGE",
          source: {
            url: "https://images.prothomalo.com/prothomalo-bangla%2F2024-07-31%2Ffvw12evl%2F5.jpg",
          },
          text: 49,
        },
        url: "https://www.prothomalo.com/photo/bangladesh/9xqtx532v2",
      },
    ],
  },
  {
    id: 41,
    title: "বৃহস্পতিবার, ০১ আগস্ট, ২০২৪",
    date: "2024-08-01",
    items: [
      {
        id: 50,
        cardTitle: "ছয় সমন্বয়ককে ছেড়ে দিল ডিবি",
        cardSubtitle: "",
        cardDetailedText:
          "গোয়েন্দা পুলিশের (ডিবি) হেফাজতে থাকা বৈষম্যবিরোধী ছাত্র আন্দোলনের ছয় সমন্বয়ককে ছেড়ে দেওয়া হয়েছে।",
        timelineEventId: 41,
        date: "2024-08-01",
        url: "https://www.prothomalo.com/bangladesh/vt91qmdtcb",
      },
    ],
  },
  {
    id: 42,
    title: "শুক্রবার, ০২ আগস্ট, ২০২৪",
    date: "2024-08-02",
    items: [
      {
        id: 51,
        cardTitle: "আন্দোলন প্রত্যাহারের বিবৃতি স্বেচ্ছায় দেইনি",
        cardSubtitle: "",
        cardDetailedText:
          "ডিবি অফিসে আটক থাকার পর গতকাল (বৃহস্পতিবার) দুপুরে বৈষম্যবিরোধী ছাত্র আন্দোলনের ছয় সমন্বয়ককে ছেড়ে দেওয়া হয়। এক্ষেত্রে গত সাত দিনে পরিবার ও তাদের সাথে নানা হয়রানি, নির্যাতন ও নাটক মঞ্চস্থ করা হয়েছে বলে সমন্বয়কগণ অভিযোগ করেছেন।\n\nগণমাধ্যমে পাঠানো বিবৃতিতে এমনটাই জানিয়েছেন ছয় সমন্বয়ক মো. নাহিদ ইসলাম, সারজিস আলম, হাসনাত আব্দুল্লাহ, আসিফ মাহমুদ, নুসরাত তাবাসসুম ও আবু বাকের মজুমদার। একইসাথে তাদের অনশনের খবর পরিবার-মিডিয়া থেকে গোপন রাখা হয় বলে অভিযোগ করেন।",
        timelineEventId: 42,
        date: "2024-08-02",
        url: "https://www.tbsnews.net/bangla/%E0%A6%AC%E0%A6%BE%E0%A6%82%E0%A6%B2%E0%A6%BE%E0%A6%A6%E0%A7%87%E0%A6%B6/news-details-239021",
      },
    ],
  },
  {
    id: 43,
    title: "শনিবার, ০৩ আগস্ট, ২০২৪",
    date: "2024-08-03",
    items: [
      {
        id: 52,
        cardTitle: "সর্বাত্মক অসহযোগ আন্দোলনের ডাক",
        cardSubtitle: "",
        cardDetailedText:
          "কোটা সংস্কার আন্দোলনের প্ল্যাটফর্ম বৈষম্যবিরোধী ছাত্র আন্দোলন নতুন কর্মসূচি ঘোষণা করেছে। আগামীকাল শনিবার সারা দেশে বিক্ষোভ মিছিল ও পরদিন রোববার থেকে সর্বাত্মক অসহযোগ আন্দোলনের ডাক দিয়েছে তারা।",
        timelineEventId: 43,
        date: "2024-08-03",
        url: "https://www.prothomalo.com/bangladesh/63by8hj4d2",
      },
      {
        id: 53,
        cardTitle:
          "সরকার পদত্যাগের এক দফা দাবি ঘোষণা বৈষম্যবিরোধী ছাত্র আন্দোলনের",
        cardSubtitle: "",
        cardDetailedText:
          "সরকার পদত্যাগের এক দফা দাবি ঘোষণা করেছে বৈষম্যবিরোধী ছাত্র আন্দোলন। আজ শনিবার রাজধানীর কেন্দ্রীয় শহীদ মিনারে হাজার হাজার মানুষের সমাবেশে বৈষম্যবিরোধী ছাত্র আন্দোলনের পক্ষ থেকে সমন্বয়ক নাহিদ ইসলাম এ ঘোষণা দেন।",
        timelineEventId: 43,
        date: "2024-08-03",
        url: "https://www.prothomalo.com/bangladesh/h4zz80m51h",
      },
    ],
  },
  {
    id: 44,
    title: "রবিবার, ০৪ আগস্ট, ২০২৪",
    date: "2024-08-04",
    items: [
      {
        id: 54,
        cardTitle: "সংঘাত–সংঘর্ষ গুলি, সারা দেশে পুলিশ সদস্যসহ নিহত ৯৮",
        cardSubtitle: "",
        cardDetailedText:
          "বৈষম্যবিরোধী ছাত্র আন্দোলনের অসহযোগ কর্মসূচি ঘিরে সারা দেশে সংঘাত–সংঘর্ষ, গুলি, পাল্টাপাল্টি ধাওয়ায় অন্তত ৯৮ জন নিহত হয়েছেন। তাঁদের মধ্যে ১৪ জন পুলিশ সদস্য। সিরাজগঞ্জের এনায়েতপুর থানায় ১৩ জন পুলিশ সদস্য নিহত হয়েছেন।",
        timelineEventId: 44,
        date: "2024-08-04",
        url: "https://www.prothomalo.com/bangladesh/6y25bped92",
      },
    ],
  },
  {
    id: 45,
    title: "সোমবার, ০৫ আগস্ট, ২০২৪",
    date: "2024-08-05",
    items: [
      {
        id: 55,
        cardTitle: "মার্চ টু ঢাকা",
        cardSubtitle: "",
        cardDetailedText:
          "সারা দেশ থেকে আন্দোলনকারীদের ঢাকায় আসার আহ্বান জানানো হয়েছে। গতকাল রোববার বৈষম্যবিরোধী ছাত্র আন্দোলনের সমন্বয়ক আসিফ মাহমুদ এক বিবৃতিতে এ আহ্বান জানান।",
        timelineEventId: 45,
        date: "2024-08-05",
        url: "https://www.prothomalo.com/bangladesh/prqt6elgqa",
      },
      {
        id: 56,
        cardTitle: "পদত্যাগ করে দেশ ছেড়েছেন শেখ হাসিনা",
        cardSubtitle: "",
        cardDetailedText:
          "বৈষম্যবিরোধী ছাত্র আন্দোলনের সরকারের পদত্যাগের এক দফা দাবির মুখে প্রধানমন্ত্রীর পদ থেকে পদত্যাগ করেছেন শেখ হাসিনা",
        timelineEventId: 45,
        date: "2024-08-05",
        url: "https://www.prothomalo.com/politics/sujnygurif",
      },
    ],
  },
];
